Revit 2024 API
TransferringProjectStandardsEventArgs Methods
The TransferringProjectStandardsEventArgs type exposes the following members.
Methods
Name | Description
Cancel
 When the event is cancellable, may call the Cancel() method to cancel it.
 (Inherited from RevitAPIPreEventArgs.)
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetExternalItems
 Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
SetExternalItems
 Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace